<!-- dflook/terraform-github-actions {"workspace":"arm","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"f0633262cb9c2c7224f1875337eb758f1026b29604506094cc20bc8a852f8a1d","plan_job_ref":"Job Test actions using target and replace #463 at https://github.com/dflook/terraform-github-actions/actions/runs/13837103990","plan_hash":"42ab9a8ddc79fc60436aa56caf6e2765130bb86f13f50100ee1f09b9051ef417","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __arm__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "lst72GAvNE" -> (known after apply)
!~  foreach = "xuvPIrkRUx" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #463](https://github.com/dflook/terraform-github-actions/actions/runs/13837103990)